In [1]:
%run py_import.py

In [2]:
obj = pd.Series(np.arange(4.0), index = ['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

### 索引

**Series**

In [5]:
print(obj['b'])
print(obj[1])

1.0
1.0
c    2.0
d    3.0
dtype: float64

In [ ]:
obj[2:4]

In [6]:
obj[['a','b','d']]

a    0.0
b    1.0
d    3.0
dtype: float64

In [7]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [8]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [9]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [13]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

**DataFrame**

In [15]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                     index = ['Ohio','Colorado','Utah','New York'],
                     columns = ['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [16]:
data['two']  # 索引一个或者多个列

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [18]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [23]:
data[:2]  # 数字索引是行

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [25]:
data[data['three'] > 5]   # 第一个方括号里面的为布尔索引

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [26]:
data < 5  # 布尔索引

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [28]:
data[data < 5] = 0   
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [29]:
data.loc['Colorado',['two','three']]  # loc：轴标签索引

two      5
three    6
Name: Colorado, dtype: int32

In [30]:
data.iloc[2,[3,0,1]]  # 第一个参数是行，第二个参数是列

four    11
one      8
two      9
Name: Utah, dtype: int32

In [31]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [32]:
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [33]:
data.iloc[:,:3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14